![New York City schoolbus](./Images/schoolbus.jpg)

Photo by [Jannis Lucas](https://unsplash.com/@jannis_lucas) on [Unsplash](https://unsplash.com).
<br>

Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a **maximum score of 800 points**. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

You have been provided with a dataset called `schools.csv`, which is previewed below.

You have been tasked with answering three key questions about New York City (NYC) public school SAT performance.

In [91]:
# Re-run this cell 
import pandas as pd

# Read in the data
schools = pd.read_csv("./Dataset/schools.csv")

# Preview the data
schools.head()
schools["total_SAT"] = schools["average_math"] + schools["average_reading"] + schools["average_writing"]

Which NYC schools have the best math results?

In [12]:
best_math_schools = schools[schools['average_math']>=800*0.8][['school_name','average_math']].sort_values(by='average_math', ascending=False)
best_math_schools.head()

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683

What are the top 10 performing schools based on the combined SAT scores?

In [26]:
top_10_schools = schools[['school_name','average_math','average_reading','average_writing']]
top_10_schools['total_SAT'] = (top_10_schools['average_math'] + top_10_schools['average_reading'] + top_10_schools['average_writing'])

top_10_schools = top_10_schools[['school_name','total_SAT']].sort_values(by='total_SAT', ascending=False).head(10)

top_10_schools.head(10)

C:\Users\radus\AppData\Local\Temp\ipykernel_20344\2393245453.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  top_10_schools['total_SAT'] = (top_10_schools['average_math'] + top_10_schools['average_reading'] + top_10_schools['average_writing'])

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

Which NYC schools have the best math results?

In [94]:
boroughs = schools.groupby("borough")["total_SAT"].agg(["count", "mean", "std"]).round(2)

largest_std_dev = boroughs[boroughs["std"] == boroughs["std"].max()]

largest_std_dev = largest_std_dev.rename(columns={"count": "num_schools", "mean": "average_SAT", "std": "std_SAT"})

largest_std_dev.reset_index(inplace=True)
largest_std_dev

     borough  num_schools  average_SAT  std_SAT
0  Manhattan           89      1340.13   230.29